<template>
    <div class="task20 border">
        <h4 class="header">20. Перебор группы тегов в Vue</h4>
        <div class="item" v-for="(item, key, index) in items">
            <p><b>{{key}}</b></p>
            <p v-if="disable[index]">{{ item }}</p>
            <button @click="showInfo(index)"> {{ disable[index] ? 'скрыть' : 'подробнее...' }} </button>
        </div>
        
    </div>
</template>

<script>
export default {
    name: 'task20', 
    data() {
        return {
            disable: [false, false, false],
            items: {
                HTML: 'это код, который используется для структурирования и отображения веб-страницы и её контента. Например, контент может быть структурирован внутри множества параграфов, маркированных списков или с использованием изображений и таблиц данных. Как видно из названия, эта статья даст вам базовое понимание HTML и его функций.', 
                CSS: 'это код, который вы используете для стилизации вашей веб-страницы. Основы CSS помогут вам понять, что вам нужно для начала работы. Мы ответим на такие вопросы как: Как сделать мой текст черным или красным? Как сделать так, чтобы контент появлялся в определённом месте на экране? Как украсить мою веб-страницу с помощью фоновых изображений и цветов?', 
                JavaScript: 'это язык программирования, который добавляет интерактивность на ваш веб-сайт (например: игры, отклик при нажатии кнопок или при вводе данных в формы, динамические стили, анимация). Эта статья поможет вам начать работать с этим захватывающим языком и даст вам представление о том, на что он способен.',
            },
        }
    },
    methods: {
        showInfo: function(num) {
            this.disable[num] = !this.disable[num];
        }
    }
}
</script>

<style scoped>
.header{
    margin-bottom: 10px;
}

.item{
    margin-bottom: 15px;
}

button{
    width: 100px;
    height: 25px;
    margin-top: 5px;
}

</style>